IDEA Open Model
CrossSectionFactory.FillColdFormedZed Method
Compatible with IDEA StatiCa 20.1
 Fill parameters for cold formed Z-ed section
 Namespace: IdeaRS.OpenModel.CrossSection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public static void FillColdFormedZed(
	CrossSectionParameter css,
	double Width,
	double Height,
	double Thickness,
	double Radius,
	double Lip,
	bool Mirror
)
Public Shared Sub FillColdFormedZed (
	css As CrossSectionParameter,
	Width As Double,
	Height As Double,
	Thickness As Double,
	Radius As Double,
	Lip As Double,
	Mirror As Boolean
)
Parameters
css
Type: IdeaRS.OpenModel.CrossSection.CrossSectionParameter
Parameters of CrossSectionParameter will be filled
Width
Type: System.Double
Css width
Height
Type: System.Double
Height of cross-section
Thickness
Type: System.Double
Thickness
Radius
Type: System.Double
Inside radius
Lip
Type: System.Double
Lip length
Mirror
Type: System.Boolean
Mirrored shape
Remarks
Dimension of cold formed Z-ed section
Examples
 This sample shows how to call this method./>
CrossSectionParameter css = new CrossSectionParameter();
css.Id = 7;
css.Material = new ReferenceElement(openStructModel.MatSteel.First());
double Width = 0.15;
double Height = 0.20;
double Thickness = 0.004;
double Radius = 0.01;
double Lip = 0.02;
bool Mirror = false;
CrossSectionFactory.FillColdFormedZed(css, Width, Height, Thickness, Radius, Lip, Mirror);
openStructModel.AddObject(css);
See Also
Reference
CrossSectionFactory Class
IdeaRS.OpenModel.CrossSection Namespace